
// Отримуємо елемент контейнера
const productContainer = document.getElementById('product');






// Масив зображень
const SOFAS = {
  images: [


    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------


    //-------------------------ПРЯМІ-----------------------------
    [1, "../assets/images/straight sofas/p1_1.jpg", "../assets/images/straight sofas/p1_2.jpg", "../assets/images/straight sofas/p1_3.jpg"],
    [2, "../assets/images/straight sofas/p2_1.jpg", "../assets/images/straight sofas/p2_2.jpg", "../assets/images/straight sofas/p2_3.jpg"],
    [3, "../assets/images/straight sofas/p3_1.jpg", "../assets/images/straight sofas/p3_2.jpg", "../assets/images/straight sofas/p3_3.jpg"],
    [4, "../assets/images/straight sofas/p4_1.jpg", "../assets/images/straight sofas/p4_2.jpg", "../assets/images/straight sofas/p4_3.jpg"],
    [5, "../assets/images/straight sofas/p5_1.jpg", "../assets/images/straight sofas/p5_3.jpg"],
    [6, "../assets/images/straight sofas/p6_1.jpg", "../assets/images/straight sofas/p6_2.jpg", "../assets/images/straight sofas/p6_3.jpg"],
    [7, "../assets/images/straight sofas/p7_1.jpg", "../assets/images/straight sofas/p7_2.jpg", "../assets/images/straight sofas/p7_3.jpg"],
    [8, "../assets/images/straight sofas/p8_1.jpg", "../assets/images/straight sofas/p8_2.jpg", "../assets/images/straight sofas/p8_3.jpg"],
    [17, "../assets/images/straight sofas/p9_1.jpg", "../assets/images/straight sofas/p9_2.jpg"],
    [18, "../assets/images/straight sofas/p10_1.jpg", "../assets/images/straight sofas/p10_2.jpg", "../assets/images/straight sofas/p10_3.jpg", "../assets/images/straight sofas/p10_4.jpg", "../assets/images/straight sofas/p10_5.jpg"],

    //-------------------------КУТ-----------------------------
    [9, "../assets/images/corner sofas/k1_1.png", "../assets/images/corner sofas/k1_2.jpg", "../assets/images/corner sofas/k1_3.jpg"],
    [10, "../assets/images/corner sofas/k2_1.jpg", "../assets/images/corner sofas/k2_2.jpg", "../assets/images/corner sofas/k2_3.jpg"],
    [11, "../assets/images/corner sofas/k3_1.jpg", "../assets/images/corner sofas/k3_2.jpg", "../assets/images/corner sofas/k3_3.jpg", "../assets/images/corner sofas/k3_4.jpg", "../assets/images/corner sofas/k3_5.jpg"],
    [12, "../assets/images/corner sofas/k4_1.jpg", "../assets/images/corner sofas/k4_2.jpg", "../assets/images/corner sofas/k4_3.jpg", "../assets/images/corner sofas/k4_4.jpg", "../assets/images/corner sofas/k4_5.jpg"],
    [13, "../assets/images/corner sofas/k5_1.jpg", "../assets/images/corner sofas/k5_2.jpg", "../assets/images/corner sofas/k5_3.jpg", "../assets/images/corner sofas/k5_4.jpg"],
    [20, "../assets/images/corner sofas/k6_1.jpg", "../assets/images/corner sofas/k6_2.jpg", "../assets/images/corner sofas/k6_3.jpg", "../assets/images/corner sofas/k6_4.jpg", "../assets/images/corner sofas/k6_5.jpg", "../assets/images/corner sofas/k6_6.jpg", "../assets/images/corner sofas/k6_7.jpg"],
    [19, "../assets/images/corner sofas/k7_1.jpg", "../assets/images/corner sofas/k7_2.jpg", "../assets/images/corner sofas/k7_3.jpg", "../assets/images/corner sofas/k7_4.jpg", "../assets/images/corner sofas/k7_5.jpg"],

    //-------------------------МОД-----------------------------
    [14, "../assets/images/modular sofas/m1_1.png", "../assets/images/modular sofas/m1_2.jpg", "../assets/images/modular sofas/m1_3.jpg"],
    [15, "../assets/images/modular sofas/m2_1.jpg", "../assets/images/modular sofas/m2_2.jpg", "../assets/images/modular sofas/m2_3.jpg"],
    [16, "../assets/images/modular sofas/m3_1.jpg", "../assets/images/modular sofas/m3_2.jpg", "../assets/images/modular sofas/m3_3.jpg", "../assets/images/modular sofas/m3_4.jpg", "../assets/images/modular sofas/m3_5.jpg"],

    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------

    //-------------------------СТАНДАРТ-----------------------------
    [21, "../assets/images/puffs/standartPuf/puf1_1.jpg", "../assets/images/puffs/standartPuf/puf1_2.jpg"],
    [27, "../assets/images/puffs/standartPuf/puf7_1.jpg", "../assets/images/puffs/standartPuf/puf7_2.jpg", "../assets/images/puffs/standartPuf/puf7_3.jpg"],

    //-------------------------ВІДКРИВАШКА-----------------------------
    [22, "../assets/images/puffs/openPuf/puf2_1.jpg", "../assets/images/puffs/openPuf/puf2_2.jpg", "../assets/images/puffs/openPuf/puf2_3.jpg", "../assets/images/puffs/openPuf/puf2_4.jpg", "../assets/images/puffs/openPuf/puf2_5.jpg"],
    [23, "../assets/images/puffs/openPuf/puf3_1.jpg", "../assets/images/puffs/openPuf/puf3_2.jpg", "../assets/images/puffs/openPuf/puf3_3.jpg", "../assets/images/puffs/openPuf/puf3_4.jpg", "../assets/images/puffs/openPuf/puf3_5.jpg"],
    [26, "../assets/images/puffs/openPuf/puf6_1.jpg", "../assets/images/puffs/openPuf/puf6_2.jpg"],

    //-------------------------5 В 1-----------------------------
    [24, "../assets/images/puffs/puf5v1/puf4_1.jpg", "../assets/images/puffs/puf5v1/puf4_2.jpg", "../assets/images/puffs/puf5v1/puf4_3.jpg", "../assets/images/puffs/puf5v1/puf4_4.jpg", "../assets/images/puffs/puf5v1/puf4_5.jpg", "../assets/images/puffs/puf5v1/puf4_6.jpg"],
    [25, "../assets/images/puffs/puf5v1/puf5_1.jpg", "../assets/images/puffs/puf5v1/puf5_2.jpg", "../assets/images/puffs/puf5v1/puf5_3.jpg", "../assets/images/puffs/puf5v1/puf5_4.jpg", "../assets/images/puffs/puf5v1/puf5_5.jpg", "../assets/images/puffs/puf5v1/puf5_6.jpg"],


    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------

    [28, "../assets/images/bads/double/bad1_1.jpg", "../assets/images/bads/double/bad1_2.jpg", "../assets/images/bads/double/bad1_3.jpg", "../assets/images/bads/double/bad1_4.jpg", "../assets/images/bads/double/bad1_5.jpg"],
    [29, "../assets/images/bads/double/bad2_1.jpg", "../assets/images/bads/double/bad2_2.jpg", "../assets/images/bads/double/bad2_3.jpg"],
    [30, "../assets/images/bads/double/bad3_1.jpg", "../assets/images/bads/double/bad3_2.jpg", "../assets/images/bads/double/bad3_3.jpg", "../assets/images/bads/double/bad3_4.jpg", "../assets/images/bads/double/bad3_5.jpg"],
    [31, "../assets/images/bads/double/bad4_1.jpg", "../assets/images/bads/double/bad4_2.jpg", "../assets/images/bads/double/bad4_3.jpg"],
    [32, "../assets/images/bads/double/bad5_1.jpg", "../assets/images/bads/double/bad5_2.jpg", "../assets/images/bads/double/bad5_3.jpg", "../assets/images/bads/double/bad5_4.jpg"],
    [33, "../assets/images/bads/single/bad6_1.jpg", "../assets/images/bads/single/bad6_2.jpg", "../assets/images/bads/single/bad6_3.jpg", "../assets/images/bads/single/bad6_4.jpg", "../assets/images/bads/single/bad6_5.jpg"],
    [41, "../assets/images/bads/double/bad7_1.jpg", "../assets/images/bads/double/bad7_2.jpg", "../assets/images/bads/double/bad7_3.jpg", "../assets/images/bads/double/bad7_4.jpg", "../assets/images/bads/double/bad7_5.jpg"],
  
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
  
    [34, "../assets/images/restM/rest1_1.jpg", "../assets/images/restM/rest1_2.jpg", "../assets/images/restM/rest1_3.jpg"],
    [35, "../assets/images/restM/rest2_1.jpg", "../assets/images/restM/rest2_2.jpg", "../assets/images/restM/rest2_3.jpg", "../assets/images/restM/rest2_4.jpg",],
    [36, "../assets/images/restM/rest3_1.jpg", "../assets/images/restM/rest3_2.jpg"],
    [37, "../assets/images/restM/rest4_1.jpg", "../assets/images/restM/rest4_2.jpg", "../assets/images/restM/rest4_3.jpg"],

    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
  
    [38, "../assets/images/banket/bank1_1.jpg", "../assets/images/banket/bank1_2.jpg"],
    // [39, "../assets/images/banket/bank2_1.jpg", "../assets/images/banket/bank2_2.jpg"],
    [40, "../assets/images/banket/bank3_1.jpg", "../assets/images/banket/bank3_2.jpg", "../assets/images/banket/bank3_3.jpg"],
  ],

  ops: [

    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------

    //-------------------------ПРЯМІ-----------------------------
    [1, "В основі дивана «HEAVEN» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які прямокутні підлокітники надають строгий консервативний вигляд.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [2, "В основі дивана «BOSS» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які округлені підлокітники надають затишний домашній вигляд.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [3, "В основі дивана «GREENFIELD» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які округлені підлокітники, що мають шухляду що відкривається.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [4, "В основі дивана «LORD» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які прямокутні підлокітники збільшеного розміру з кантом, який надає розкішного зовнішнього вигляду вигляду.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [5, "В основі дивана «BOSS» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які округлені підлокітники надають затишний домашній вигляд.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [6, "В основі дивана «BLISS» – надійний механізм трансформації єврокнижка. Диван має зменшені габаритні розміри, завдяки вузьким підлокітникам, що мають дерев'яну декоративну накладку. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [7, "В основі дивана «GREENFIELD» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які округлені підлокітники, що мають шухляду що відкривається.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [8, "В основі дивана «BOSS» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які округлені підлокітники надають затишний домашній вигляд.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],
    [17, "<p>Повністю м'яке сидіння та спинка неодмінно порадують ваших гостей, адже вони зможуть комфортно розміститися на дивані в лаунж-зоні. Ширина сидіння складає 150 см. Цього буде цілком достатньо, щоб зручно розмістилося двоє людей. Завдяки продуманій формі спинки дивани для кафе відмінно підтримують зручну позу, тому ваші гості почуватимуться на них, як удома.</p> <p>Купити наші дивани для кафе можна з оббивкою зі штучної шкіри або велюру. Вона легко приберається від забруднень (для цього підійде навіть волога серветка). Модель дуже стійка – чотири металеві ніжки та міцний каркас витримують великі навантаження.</p> <p>Серед переваг можна відзначити:</p> <p>◉ стильний дизайн;</p> <p>◉ якісне виконання;</p> <p>◉ стійкість;</p> <p>◉ розумна ціна;</p> <p>◉ чудове поєднання з іншими елементами інтер'єру.</p>", "Диван для кафе/офісу"],
    [18, "В основі дивана «BOSTON» – надійний механізм трансформації єврокнижка. Ролики з захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи. М'які прямокутні підлокітники збільшеної висоти, що дозволяє зручно розташуватися у домашньому затишку під будь яким кутом у зручній позі.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Прямий диван на двох для щоденного сну"],

    //-------------------------КУТ-----------------------------
    [9, "Класичний кутовий диван «BENJAMIN» – це звична класика в сучасному виконанні. Прикрашають диван великі диванні подушки з контрастною строчкою і декоративними втяжками. В основі ортопедичного дивана – надійний механізм трансформації єврокнижка. Ролики із захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть 3 великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p>", "Класичний кутовий диван"],
    [10, "Великий кутовий диван «LOUNGE» підкорить ваших гостей вражаючими габаритами та м'якою глибокою посадкою. А, якщо хтось із них засидиться допізна, – ви легко зможете перетворити диван на просторе ліжко. Місця вистачить усім! <p>За допомогою механізму трансформації єврокнижка диван без зайвих зусиль перетворюється на мега-просторе ліжко, розміром 3.0 х 1.55 м: цільна широка секція дивана виїжджає вперед, а спинка укладається на місце, що звільнилося. Рухома частина дивана оснащена роликами з захисним покриттям, що запобігає пошкодженню підлоги.</p> <p>В дивані передбачено 2 ящика для зберігання речей і постільної білизни: 1 великий ящик під цільною виїзною секцією та 1 менший ящик під нерухомою кутовою кушеткою «крокодил» (газ-ліфт). Ящики оснащені аераторами – спеціальними отворами для циркуляції повітря.</p> <p>У комплекті йдуть 8 диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Великий кутовий диван"],
    [11, "Класичний кутовий диван «MONOLIT» – це звична класика в сучасному виконанні. Прикрашають диван великі диванні подушки з контрастною строчкою і декоративними втяжками. В основі ортопедичного дивана – надійний механізм трансформації єврокнижка. Ролики із захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть 3 великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Класичний кутовий диван"],
    [12, "Класичний кутовий диван «MONOLIT» – це звична класика в сучасному виконанні. Прикрашають диван великі диванні подушки з контрастною строчкою і декоративними втяжками. В основі ортопедичного дивана – надійний механізм трансформації єврокнижка. Ролики із захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть 3 великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Класичний кутовий диван"],
    [13, "Класичний кутовий диван «MONOLIT» – це звична класика в сучасному виконанні. Прикрашають диван великі диванні подушки з контрастною строчкою і декоративними втяжками. В основі ортопедичного дивана – надійний механізм трансформації єврокнижка. Ролики із захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть 3 великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Класичний кутовий диван"],
    [20, "Незвичайний кутовий диван-ліжко «OLIMP» – поєднує в собі класичний кутовий диван та повногабаритне двоспальне ліжко для вимогливих покупців, які хочуть бачити не тільки сучасний диван, але й повноцінне ліжко з розкішним узголів'ям. <p>У комплекті йдуть 2 великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>В дивані передбачено 2 ящика для зберігання речей і постільної білизни: 1 великий ящик під цільною виїзною секцією та 1 менший ящик під нерухомою кутовою кушеткою «крокодил» (газ-ліфт). Ящики оснащені аераторами – спеціальними отворами для циркуляції повітря.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p>", "Кутовий диван-ліжко"],
    [19, "Класичний кутовий диван «MONOLIT» – це звична класика в сучасному виконанні. Прикрашають диван великі диванні подушки з контрастною строчкою і декоративними втяжками. В основі ортопедичного дивана – надійний механізм трансформації єврокнижка. Ролики із захисним покриттям дозволяють без зайвих зусиль розкладати диван, не пошкоджуючи поверхню підлоги. В дивані є просторий ящик з аераторами (спеціальними отворами для проникнення повітря) для зберігання ваших речей і постільної білизни. На тильній стороні дивана передбачена м'яка планка, обтягнута тканиною – практична деталь, завдяки якій ви не будете притулятися до стіни під час сну. <p>У комплекті йдуть 3 великі диванні подушки в зйомних чохлах на «блискавці» з наповнювачем холлофайбер – синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p> <p>Для збірки нашого дивану вам не потрібні спеціальні навички, інструменти та болти, так як кожен наш диван має функцію швидкої збірки. Ви з легкістю зможете самостійно розібрати, або зібрати диван, що значно полегшить його трансформування</p> ", "Класичний кутовий диван"],

    //-------------------------МОД-----------------------------
    [14, "Великий модульний диван «BARON» створений для прихильників супер-комфорту. Неймовірно зручна та глибока посадка дивана подарує вам відчуття м'якого розслаблення. Широкі підлокітники, подушки та царга дивана, які надають дивану незвичайний і стильний вигляд. <p>Модульний диван «BARON» складається з п'яти частин: двох нерухомих елементів – кутової секції та кутового елемента розміром 1.0 х 1.35 м, а також з трьох рухомих секцій завширшки 1.0 м, кожна з яких може висуватися вперед незалежно від іншої. Диван може використовуватися для сну будь-яким способом:</p> <ul><li>1. розклавши тільки крайні секції, ви перетворите диван на два незалежних спальних місця, розділених середнім елементом</li><li>2. висунувши вперед обидві центральні секції та опустивши спинки – отримуєте дуже просторе ліжко</li></ul> <p>Механізм трансформації дивана – єврокнижка. Рухомі частини дивана оснащені роликами із захисним покриттям, що запобігає пошкодженню підлоги.</p> <p>У нижній частині дивана, під кожною прямою секцією є 3 просторих ящика для зберігання речей і постільної білизни. Ящики оснащені аераторами – спеціальними отворами для циркуляції повітря.</p> <p>У комплекті йдуть 6 великих диванних подушок в зйомних чохлах на «блискавці» з наповнювачем холлофайбер –синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p>", "Модульний диван"],
    [15, "Великий модульний диван «BARIN» створений для прихильників супер-комфорту. Неймовірно зручна та глибока посадка дивана подарує вам відчуття м'якого розслаблення. Широкі підлокітники, подушки та царга дивана, які надають дивану незвичайний і стильний вигляд. <p>Модульний диван «BARON» складається з п'яти частин: двох нерухомих елементів – кутової секції та кутового елемента розміром 1.0 х 1.35 м, а також з трьох рухомих секцій завширшки 1.0 м, кожна з яких може висуватися вперед незалежно від іншої. Диван може використовуватися для сну будь-яким способом:</p> <ul><li>1. розклавши тільки крайні секції, ви перетворите диван на два незалежних спальних місця, розділених середнім елементом</li><li>2. висунувши вперед обидві центральні секції та опустивши спинки – отримуєте дуже просторе ліжко</li></ul> <p>Механізм трансформації дивана – єврокнижка. Рухомі частини дивана оснащені роликами із захисним покриттям, що запобігає пошкодженню підлоги.</p> <p>У нижній частині дивана, під кожною прямою секцією є 3 просторих ящика для зберігання речей і постільної білизни. Ящики оснащені аераторами – спеціальними отворами для циркуляції повітря.</p> <p>У комплекті йдуть 6 великих диванних подушок в зйомних чохлах на «блискавці» з наповнювачем холлофайбер –синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p>", "Модульний диван"],
    [16, "Великий модульний диван «MATILDA» створений для прихильників супер-комфорту. Неймовірно зручна та глибока посадка дивана подарує вам відчуття м'якого розслаблення. Широкі підлокітники, подушки та царга дивана, які надають дивану незвичайний і стильний вигляд. <p>Модульний диван «BARON» складається з п'яти частин: двох нерухомих елементів – кутової секції та кутового елемента розміром 1.0 х 1.35 м, а також з трьох рухомих секцій завширшки 1.0 м, кожна з яких може висуватися вперед незалежно від іншої. Диван може використовуватися для сну будь-яким способом:</p> <ul><li>1. розклавши тільки крайні секції, ви перетворите диван на два незалежних спальних місця, розділених середнім елементом</li><li>2. висунувши вперед обидві центральні секції та опустивши спинки – отримуєте дуже просторе ліжко</li></ul> <p>Механізм трансформації дивана – єврокнижка. Рухомі частини дивана оснащені роликами із захисним покриттям, що запобігає пошкодженню підлоги.</p> <p>У нижній частині дивана, під кожною прямою секцією є 3 просторих ящика для зберігання речей і постільної білизни. Ящики оснащені аераторами – спеціальними отворами для циркуляції повітря.</p> <p>У комплекті йдуть 6 великих диванних подушок в зйомних чохлах на «блискавці» з наповнювачем холлофайбер –синтетичним гіпоалергенним волокном, яке не злежується і зберігає форму подушок довгий час. Наповнювач екологічний, він не горить, не вбирає вологу і запахи.</p>", "Модульний диван"],

    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------

    [21, "Неймовірно практичний елегантний пуф доповнить ваш інтер'єр. М'які лаконічні форми створюють домашній затишок.", "М'який круглий пуф"],
    [22, "<p>Пуф виглядає стильно та лаконічно, тому буде доречний у будь-якому куточку будинку. «CUBE» виготовлений із якісного ламінованого ДСП у тканинній оббивці, ідеально доповнить сучасні інтер'єри. Витримує навантаження до 150 кг. </p><p>Знімна кришка дозволяє помістити всередину: домашній текстиль або щось інше. Таким чином, можна звільнити простір у приміщенні та отримати ще одну стильну річ.</p><p>При бажанні виготовляємо пуф за вашими розмірами. Широкий вибір матеріалів дозволяє задовольнити ваші побажання.</p>", "Пуф що відкривається"],
    [23, "<p>Подвійний пуф виглядає стильно та лаконічно, тому буде доречний у будь-якому куточку будинку. «COMODO» виготовлений із якісного ламінованого ДСП у тканинній оббивці, ідеально доповнить сучасні інтер'єри. Витримує навантаження до 150 кг. Неймовірно місткий, адже його об'єм становить 30 літрів.</p><p>Знімна кришка дозволяє помістити всередину безліч речей: дитячі іграшки, книги, домашній текстиль або щось інше. Таким чином, можна звільнити простір у приміщенні та отримати ще одну стильну річ.</p><p>При бажанні виготовляємо пуф за вашими розмірами. Широкий вибір матеріалів дозволяє задовольнити ваші побажання.</p>", "Пуф що відкривається"],
    [24, "<p>Пуф-трансформер є багатофункціональними меблями, які поєднують у собі стильний дизайн, міцність та надійність конструкції, а також функціональність.</p><p>Пуф розкладається на 5 металевих стільчиків з м'якими сидіннями висотою 45 см. Зварний металевий каркас (ніжки стільчиків) виготовлений із профільної сталевої труби перетином 15х15мм із товщиною стінки 1,5мм та покритий порошковою фарбою. Для виготовлення сидінь використовуються зносостійкий меблевий велюр та екошкіра, із застосуванням різних способів оббивки: каретна стяжка або піковка.</p><p>Завдяки своєму зовнішньому вигляду та функціональності пуф можна використовувати в передпокої, вітальні, спальні, кухні, а також - в офісі, примірочному або заміському будинку (дачі). В цілому, такий Пуф обіцяє бути практичним і стильним доповненням до вашої оселі, надаючи зручне місце для сидіння, а також додає інтер'єру сучасний дизайнерський штрих.</p>", "Пуф 5 в 1"],
    [25, "<p>Пуф-трансформер є багатофункціональними меблями, які поєднують у собі стильний дизайн, міцність та надійність конструкції, а також функціональність.</p><p>Пуф розкладається на 5 металевих стільчиків з м'якими сидіннями висотою 45 см. Зварний металевий каркас (ніжки стільчиків) виготовлений із профільної сталевої труби перетином 15х15мм із товщиною стінки 1,5мм та покритий порошковою фарбою. Для виготовлення сидінь використовуються зносостійкий меблевий велюр та екошкіра, із застосуванням різних способів оббивки: каретна стяжка або піковка.</p><p>Завдяки своєму зовнішньому вигляду та функціональності пуф можна використовувати в передпокої, вітальні, спальні, кухні, а також - в офісі, примірочному або заміському будинку (дачі). В цілому, такий Пуф обіцяє бути практичним і стильним доповненням до вашої оселі, надаючи зручне місце для сидіння, а також додає інтер'єру сучасний дизайнерський штрих.</p>", "Пуф 5 в 1"],
    [26, "<p>Пуф виглядає стильно та лаконічно, тому буде доречний у будь-якому куточку будинку. «LIKE» виготовлений із якісного ламінованого ДСП у тканинній оббивці, ідеально доповнить сучасні інтер'єри. Витримує навантаження до 150 кг. </p><p>Відкидна кришка дозволяє помістити всередину: домашній текстиль або щось інше. Таким чином, можна звільнити простір у приміщенні та отримати ще одну стильну річ.</p><p>При бажанні виготовляємо пуф за вашими розмірами. Широкий вибір матеріалів дозволяє задовольнити ваші побажання.</p>", "Пуф що відкривається"],
    [27, "Неймовірно практичний елегантний пуф доповнить ваш інтер'єр. М'які лаконічні форми створюють домашній затишок.", "М'який круглий пуф"],

    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------

    [28, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p>  <p> Виготовлення матрацу за замовленням.</p>", "Двоспальне ліжко"],
    [29, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p> <p> Виготовлення матрацу за замовленням.</p>", "Двоспальне ліжко"],
    [30, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p> <p> Виготовлення матрацу за замовленням.</p>", "Двоспальне ліжко"],
    [31, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p> <p> Виготовлення матрацу за замовленням.</p>", "Двоспальне ліжко"],
    [32, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p> <p> Виготовлення матрацу за замовленням.</p>", "Двоспальне ліжко"],
    [33, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p> <p> Виготовлення матрацу за замовленням.</p>", "Односпальне ліжко"],
    [41, "<p>Дуже елегантне, сучасне м'яке ліжко. Оббита стильним, м'яким велюром. Виготовлена ​​із високоякісних матеріалів: основою конструкції є міцний металевий каркас, що відкривається за допомогою газліфту. Основа ліжка складається з пружинних ламелей, виготовлених з бука. </p><p>Вбудований газовий амортизатор забезпечує легкий та плавний доступ до простору під каркасом. Достатньо лише одного руху газовий амортизатор зробить все інше за вас! </p><p>Особливості та переваги: </p><p> Комфортний відпочинок. 30 пружинних ламелів з буку найвищої якості забезпечують оптимальну підтримку матраца.</p><p> Ламелі встановлені на міцній металевій рамі, що забезпечує стабільну опору.</p> <p> Виготовлення матрацу за замовленням.</p>", "Двоспальне ліжко"],

    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
  
    [34, "<p>Невеликий зручний диван-лавка. Ідеально підійде для салонів краси, в офіс або прикрасить вашу оселю.</p> <p>◉ Компактний, не займає багато місця;</p> <p>◉ Відмінно впишеться у будь-який дизайн приміщення;</p> <p>◉ Матеріал оббивки – екошкіра або велюр за замовленням.</p> <p>Диван стане відмінним рішенням, яке дозволить стильно та сучасно прикрасити будь-який інтер'єр, наповнюючи атмосферу закладу комфортом та стилем. Конструкція дивана універсальна – вона гармонійно виглядатиме у закладі будь-якого формату, де використовуються риси сучасного інтер'єру. Компактна та функціональна конструкція дивана дозволить розташувати його у будь-якій частині приміщення.</p>", "Диван для кафе/офісу"],
    [35, "<p>Повністю м\'яке сидіння та спинка неодмінно порадують ваших гостей, адже вони зможуть комфортно розміститися на дивані в лаунж-зоні. Ширина сидіння складає 150 см. Цього буде цілком достатньо, щоб зручно розмістилося двоє людей. Завдяки продуманій формі спинки дивани для кафе відмінно підтримують зручну позу, тому ваші гості почуватимуться на них, як удома.</p> <p>Купити наші дивани для кафе можна з оббивкою зі штучної шкіри або велюру. Вона легко приберається від забруднень (для цього підійде навіть волога серветка). Модель дуже стійка – чотири металеві ніжки та міцний каркас витримують великі навантаження.</p> <p>Серед переваг можна відзначити:</p> <p>◉ стильний дизайн;</p> <p>◉ якісне виконання;</p> <p>◉ стійкість;</p> <p>◉ розумна ціна;</p> <p>◉ чудове поєднання з іншими елементами інтер\'єру.</p>", "Диван для кафе/офісу"],
    [36, "<p>Повністю м\'яке сидіння та спинка неодмінно порадують ваших гостей, адже вони зможуть комфортно розміститися на дивані в лаунж-зоні. Ширина сидіння складає 150 см. Цього буде цілком достатньо, щоб зручно розмістилося двоє людей. Завдяки продуманій формі спинки дивани для кафе відмінно підтримують зручну позу, тому ваші гості почуватимуться на них, як удома.</p> <p>Купити наші дивани для кафе можна з оббивкою зі штучної шкіри або велюру. Вона легко приберається від забруднень (для цього підійде навіть волога серветка). Модель дуже стійка – чотири металеві ніжки та міцний каркас витримують великі навантаження.</p> <p>Серед переваг можна відзначити:</p> <p>◉ стильний дизайн;</p> <p>◉ якісне виконання;</p> <p>◉ стійкість;</p> <p>◉ розумна ціна;</p> <p>◉ чудове поєднання з іншими елементами інтер\'єру.</p>", "Диван для кафе/офісу"],
    [37, "<p>Повністю м\'яке сидіння та спинка неодмінно порадують ваших гостей, адже вони зможуть комфортно розміститися на дивані в лаунж-зоні. Ширина сидіння складає 150 см. Цього буде цілком достатньо, щоб зручно розмістилося двоє людей. Завдяки продуманій формі спинки дивани для кафе відмінно підтримують зручну позу, тому ваші гості почуватимуться на них, як удома.</p> <p>Купити наші дивани для кафе можна з оббивкою зі штучної шкіри або велюру. Вона легко приберається від забруднень (для цього підійде навіть волога серветка). Модель дуже стійка – чотири металеві ніжки та міцний каркас витримують великі навантаження.</p> <p>Серед переваг можна відзначити:</p> <p>◉ стильний дизайн;</p> <p>◉ якісне виконання;</p> <p>◉ стійкість;</p> <p>◉ розумна ціна;</p> <p>◉ чудове поєднання з іншими елементами інтер\'єру.</p>", "Диван для кафе/офісу"],

    //--------------------------------------------------------------------------------БАНКЕТКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
  
    [38, "Банкетка у прихожу, коридор, банкетка стане ідеальним доповненням до інтер'єру. Банкетка без проблем зможе створити ідеальну зону відпочинку у будь-якій кімнаті. Банкетка багатофункціональна. Полиці можна використовувати під взуття або зберігання інших потрібних речей, а верхня полиця для сумок, головних уборів і т.д. або ж просто сісти на неї. Адже навантаження її до 150 кг.", "Банкетка"],
    // [39, "<p>Пуф виглядає стильно та лаконічно, тому буде доречний у будь-якому куточку будинку. «LIKE» виготовлений із якісного ламінованого ДСП у тканинній оббивці, ідеально доповнить сучасні інтер'єри. Витримує навантаження до 150 кг. </p><p>Відкидна кришка дозволяє помістити всередину: домашній текстиль або щось інше. Таким чином, можна звільнити простір у приміщенні та отримати ще одну стильну річ.</p><p>При бажанні виготовляємо пуф за вашими розмірами. Широкий вибір матеріалів дозволяє задовольнити ваші побажання.</p>", "Пуф що відкривається"],
    [40, "Банкетка у прихожу, коридор, банкетка стане ідеальним доповненням до інтер'єру. Банкетка без проблем зможе створити ідеальну зону відпочинку у будь-якій кімнаті. Банкетка багатофункціональна. Полиці можна використовувати під взуття або зберігання інших потрібних речей, а верхня полиця для сумок, головних уборів і т.д. або ж просто сісти на неї. Адже навантаження її до 150 кг.", "Банкетка"],
  ],

  fixHeight: [

    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ДИВАНИ---------------------------------------------------------------------------------


    //-------------------------ПРЯМІ-----------------------------
    [1, "width: 650px; height: 350px; object-fit: cover;"],
    [2, "width: 650px; height: 420px; object-fit: cover; margin-top: -20px;"],
    [3, "width: 650px; height: 380px; object-fit: cover; margin-top: -20px;"],
    [4, "width: 650px; height: 350px; object-fit: cover; "],
    [5, "width: 650px; height: 422px; object-fit: cover;"],
    [6, "width: 650px; height: 405px; object-fit: cover;"],
    [7, "width: 650px; height: 435px; object-fit: cover; margin-top: -60px;"],
    [8, "width: 650px; height: 370px; object-fit: cover;"],
    [17, "width: 650px; height: 435px; object-fit: cover;     margin-right: -20px;     margin-left: 20px;"],
    // [10, "../assets/images/straight sofas/p9_2.jpg", "width: 650px; height: 435px; object-fit: cover; margin-right: -30px; margin-left: 60px;"],
    [18, "width: 700px;  object-fit: cover;"],

    //-------------------------КУТ-----------------------------
    [9, "width: 700px; object-fit: cover;"],
    [10, "width: 650px; height: 400px; object-fit: cover;"],
    [11, "width: 650px; height: 355px; object-fit: cover;"],
    [12, "width: 650px; height: 400px; object-fit: cover;"],
    [13, "width: 650px; height: 430px; object-fit: cover;"],
    [20, "width: 650px; object-fit: cover;     margin-right: -50px;     margin-left: 50px;"],
    [19, "width: 700px;  object-fit: cover;"],

    //-------------------------МОД-----------------------------
    [14, "width: 700px; object-fit: cover;"],
    [15, "width: 700px; height: 350px; object-fit: cover;"],
    [16, "width: 700px; height: 350px; object-fit: cover;"],


    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ПУФИ---------------------------------------------------------------------------------

    [21, "width: 700px; height: 350px; object-fit: contain;"],
    [22, "width: 700px; height: 350px; object-fit: contain;"],
    [23, "width: 700px; height: 350px; object-fit: contain;"],
    [24, "width: 700px; height: 350px; object-fit: contain; padding: 25px !important;"],
    [25, "width: 700px; height: 350px; object-fit: contain; padding: 25px !important;"],
    [26, "width: 700px; height: 350px; object-fit: contain;"],
    [27, "width: 700px; height: 350px; object-fit: contain;"],

    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------ЛІЖКА---------------------------------------------------------------------------------

    [28, "width: 700px; height: 350px; object-fit: contain;"],
    [29, "width: 700px; height: 350px; object-fit: contain;"],
    [30, "width: 700px; height: 450px; object-fit: contain;"],
    [31, "width: 700px; height: 350px; object-fit: contain;"],
    [32, "width: 700px; height: 350px; object-fit: contain;"],
    [33, "width: 700px; height: 350px; object-fit: contain;"],
    [41, "width: 700px; height: 450px; object-fit: contain;"],

    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
  
    [34, "width: 700px; height: 350px; object-fit: contain;"],
    [35, "width: 700px; height: 350px; object-fit: contain;"],
    [36, "width: 700px; height: 350px; object-fit: contain;"],
    [37, "width: 700px; height: 350px; object-fit: contain;"],
  
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------РЕСТОРАН---------------------------------------------------------------------------------
   
    [38, "width: 700px; height: 350px; object-fit: contain;"],
    // [39, "width: 700px; height: 350px; object-fit: contain;"],
    [40, "width: 700px; height: 350px; object-fit: contain;"],

  ]
  


};

const getImagesArray = (imageKey) => {
  for (let i = 0; i < SOFAS.images.length; i++) {
    if (SOFAS.images[i][0] === imageKey) {
      return SOFAS.images[i]; // Повертаємо масив без першого елемента
    }
  }
  return [];
}

const getOpsArray = (imageKey) => {
  for (let i = 0; i < SOFAS.ops.length; i++) {
    if (SOFAS.ops[i][0] === imageKey) {
      return SOFAS.ops[i]; // Повертаємо опис для відповідного ключа
    }
  }
  return "";
}

const getFixHeight = (imageKey) => {
  for (let i = 0; i < SOFAS.fixHeight.length; i++) {
    if (SOFAS.fixHeight[i][0] === imageKey) {
      return SOFAS.fixHeight[i][1]; // Повертаємо опис для відповідного ключа
    }
  }
  return "";

}
// Отримуємо id з URL
const urlParams = new URLSearchParams(window.location.search);
const productId = parseInt(urlParams.get('productId'));

// Знаходимо відповідний продукт
const product = CardsArray.find(card => card._id === productId);

// Якщо продукт знайдено, відображаємо його деталі
if (product) {
  // Знайдемо зображення для цього продукту
  const imagesArray = SOFAS.images.find(images => images[0] === productId).slice(1);

  const opsDescription = SOFAS.ops.find(ops => ops[0] === productId).slice(1);
  const FixHeightArr = SOFAS.fixHeight.find(fixHeight => fixHeight[0] === productId).slice(1);

  const thumbnails = imagesArray.map(image => `
      <img
        class="product-image"
        src="${image}"
        alt="product image"
        data-src="${image}"
      />
    `).join('');
  // Створюємо HTML для продукту
  let productHTML = `
      <div class="product-row">
  
      <div class="slider">
          <div class="thumbnails">
          ${thumbnails}
          </div>
          <div class="main-image">
              <button class="nav prev"></button>
              <figure class="fade">
              <img src="${imagesArray[0]}" alt="Main Image" id="main-image"  style="${FixHeightArr[0]}">
              </figure>
              <button class="nav next"></button>
          </div>
      </div>
        
      
      </div>
      <div class="call-sell">
      <h1>${product.name}</h1>
      <span class="price-cont">
               <span class="price">Ціна: ${product.price}</span>
                 грн
              </span>
              <h2>${opsDescription[1]}</h2>
            <h2 class="block-icons"> <svg xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 512 512"><!--!Font Awesome Free 6.6.0 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free Copyright 2024 Fonticons, Inc.-->
              <path fill="#3d2808"
                d="M444 49.9C431.3 38.2 379.9 .9 265.3 .4c0 0-135.1-8.1-200.9 52.3C27.8 89.3 14.9 143 13.5 209.5c-1.4 66.5-3.1 191.1 117 224.9h.1l-.1 51.6s-.8 20.9 13 25.1c16.6 5.2 26.4-10.7 42.3-27.8 8.7-9.4 20.7-23.2 29.8-33.7 82.2 6.9 145.3-8.9 152.5-11.2 16.6-5.4 110.5-17.4 125.7-142 15.8-128.6-7.6-209.8-49.8-246.5zM457.9 287c-12.9 104-89 110.6-103 115.1-6 1.9-61.5 15.7-131.2 11.2 0 0-52 62.7-68.2 79-5.3 5.3-11.1 4.8-11-5.7 0-6.9 .4-85.7 .4-85.7-.1 0-.1 0 0 0-101.8-28.2-95.8-134.3-94.7-189.8 1.1-55.5 11.6-101 42.6-131.6 55.7-50.5 170.4-43 170.4-43 96.9 .4 143.3 29.6 154.1 39.4 35.7 30.6 53.9 103.8 40.6 211.1zm-139-80.8c.4 8.6-12.5 9.2-12.9 .6-1.1-22-11.4-32.7-32.6-33.9-8.6-.5-7.8-13.4 .7-12.9 27.9 1.5 43.4 17.5 44.8 46.2zm20.3 11.3c1-42.4-25.5-75.6-75.8-79.3-8.5-.6-7.6-13.5 .9-12.9 58 4.2 88.9 44.1 87.8 92.5-.1 8.6-13.1 8.2-12.9-.3zm47 13.4c.1 8.6-12.9 8.7-12.9 .1-.6-81.5-54.9-125.9-120.8-126.4-8.5-.1-8.5-12.9 0-12.9 73.7 .5 133 51.4 133.7 139.2zM374.9 329v.2c-10.8 19-31 40-51.8 33.3l-.2-.3c-21.1-5.9-70.8-31.5-102.2-56.5-16.2-12.8-31-27.9-42.4-42.4-10.3-12.9-20.7-28.2-30.8-46.6-21.3-38.5-26-55.7-26-55.7-6.7-20.8 14.2-41 33.3-51.8h.2c9.2-4.8 18-3.2 23.9 3.9 0 0 12.4 14.8 17.7 22.1 5 6.8 11.7 17.7 15.2 23.8 6.1 10.9 2.3 22-3.7 26.6l-12 9.6c-6.1 4.9-5.3 14-5.3 14s17.8 67.3 84.3 84.3c0 0 9.1 .8 14-5.3l9.6-12c4.6-6 15.7-9.8 26.6-3.7 14.7 8.3 33.4 21.2 45.8 32.9 7 5.7 8.6 14.4 3.8 23.6z" />
            </svg><span class="phone-sell">+380 63 934 0346</span></h2>
            <h2 class="block-icons"><svg xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 448 512"><!--!Font Awesome Free 6.6.0 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free Copyright 2024 Fonticons, Inc.-->
              <path fill="#3d2808"
                d="M64 32C28.7 32 0 60.7 0 96L0 416c0 35.3 28.7 64 64 64l320 0c35.3 0 64-28.7 64-64l0-320c0-35.3-28.7-64-64-64L64 32zm90.7 96.7c9.7-2.6 19.9 2.3 23.7 11.6l20 48c3.4 8.2 1 17.6-5.8 23.2L168 231.7c16.6 35.2 45.1 63.7 80.3 80.3l20.2-24.7c5.6-6.8 15-9.2 23.2-5.8l48 20c9.3 3.9 14.2 14 11.6 23.7l-12 44C336.9 378 329 384 320 384C196.3 384 96 283.7 96 160c0-9 6-16.9 14.7-19.3l44-12z" />
            </svg> <span class="phone-sell">+380 67 859 5561</span></h2>            
            <h2 class="block-icons"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--!Font Awesome Free 6.6.0 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free Copyright 2024 Fonticons, Inc.--><path fill="#3d2808" d="M248 8C111 8 0 119 0 256S111 504 248 504 496 393 496 256 385 8 248 8zM363 176.7c-3.7 39.2-19.9 134.4-28.1 178.3-3.5 18.6-10.3 24.8-16.9 25.4-14.4 1.3-25.3-9.5-39.3-18.7-21.8-14.3-34.2-23.2-55.3-37.2-24.5-16.1-8.6-25 5.3-39.5 3.7-3.8 67.1-61.5 68.3-66.7 .2-.7 .3-3.1-1.2-4.4s-3.6-.8-5.1-.5q-3.3 .7-104.6 69.1-14.8 10.2-26.9 9.9c-8.9-.2-25.9-5-38.6-9.1-15.5-5-27.9-7.7-26.8-16.3q.8-6.7 18.5-13.7 108.4-47.2 144.6-62.3c68.9-28.6 83.2-33.6 92.5-33.8 2.1 0 6.6 .5 9.6 2.9a10.5 10.5 0 0 1 3.5 6.7A43.8 43.8 0 0 1 363 176.7z"/></svg> <span class="phone-sell">@miy_divanchik</span></h2>
          </div>
          
  
      <!-- Модальне вікно для перегляду зображень -->
  <div id="image-modal" class="modal">
    <span class="close">&times;</span>
    <img class="modal-content" id="modal-image">
    <div id="caption"></div>
  </div>
          
      <div class="product-info">      
        
        <div class="product-description" id="content-1">${product.description}</div>
        <div class="product-description" id="content-2">
        <h1>ОПИС</h1>
        <p class="descr-tab2">${opsDescription[0]}</p>
        </div>
        <div class="product-description" id="content-3">
        <h1>ДОСТАВКА ЗА ДОМОВЛЕНІСТЮ</h1>
        <p>Доставка до під'їзду за домовленістю — це зручна послуга, яка дозволяє доставити товар до входу в будинок клієнта в узгоджений час. Це може бути особливо корисно для людей, які не можуть особисто забрати замовлення, або ж бажають отримати його в конкретний час. Така послуга може включати попередній дзвінок кур'єра перед доставкою, щоб узгодити час і забезпечити зручність для клієнта.</p>
        </div>
        <div class="tab-nav">
          <input checked id="tab-btn-1" name="tab-btn" type="radio" value="">
          <label for="tab-btn-1" class="tab-btn-1">Характеристики <div class="fix-shadow-1"></div></label>
          <input id="tab-btn-2" name="tab-btn" type="radio" value="">
          <label for="tab-btn-2" class="tab-btn-2">Опис <div class="fix-shadow-2-3"></div></label>
          <input id="tab-btn-3" name="tab-btn" type="radio" value="">
          <label for="tab-btn-3" class="tab-btn-3">Доставка <div class="fix-shadow-2-3"></div></label>
        </div>
        
      </div>
      <h1 >Наші роботи</h1>
          <div class="carousel">
          
      <div class="carousel-inner">
        <!-- Add your images here -->
        <img src="../assets/images/karusel/47.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/2.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/3.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/4.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/5.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/72.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/7.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/8.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/10.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/11.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/12.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/13.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/71.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/15.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/48.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/17.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/18.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/19.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/20.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/21.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/22.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/23.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/24.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/25.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/26.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/52.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/28.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/69.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/55.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/31.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/32.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/33.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/34.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/35.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/59.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/37.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/38.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/39.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/60.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/61.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/42.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/67.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/44.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/63.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/73.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/74.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/75.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/76.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/77.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/78.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/79.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/80.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/81.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/82.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/47.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/2.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/3.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/4.jpg" alt="Image 2" class="carousel-image">
        <img src="../assets/images/karusel/5.jpg" alt="Image 1" class="carousel-image">
        <img src="../assets/images/karusel/72.jpg" alt="Image 2" class="carousel-image">    
  
        <!-- Repeat for all images -->
      </div>
    </div>
        
    `;

  // Додаємо зображення продукту
  // if (imagesArray) {
  //     imagesArray.slice(1).forEach(image => {
  //         productHTML += `<img src="${image}" alt="product image" class="product-image">`;
  //     });
  // }

  // productHTML += `
  //         </div> <!-- .product-images -->
  //     </div> <!-- .product-details -->
  // `;

  // Вставляємо HTML у контейнер
  productContainer.innerHTML = productHTML;
} else {
  // Якщо продукт не знайдено, показуємо повідомлення
  productContainer.innerHTML = '<p>Продукт не знайдено.</p>';
}

function initializeSlider() {
  const thumbnails = document.querySelectorAll('.thumbnails img');
  const mainImage = document.getElementById('main-image');
  const prevButton = document.querySelector('.nav.prev');
  const nextButton = document.querySelector('.nav.next');
  let currentIndex = 0;



  const images = Array.from(thumbnails).map(thumbnail => thumbnail.dataset.src);

  // Модальне вікно та елементи
  const modal = document.getElementById('image-modal');
  const modalImage = document.getElementById('modal-image');
  const closeModal = document.querySelector('.close');

  function updateActiveThumbnail() {
    thumbnails.forEach((thumbnail, index) => {
      if (index === currentIndex) {
        thumbnail.classList.add('active');
      } else {
        thumbnail.classList.remove('active');
      }
    });
  }

  thumbnails.forEach((thumbnail, index) => {
    thumbnail.addEventListener('click', () => {
      mainImage.src = thumbnail.dataset.src;
      currentIndex = index;
      updateActiveThumbnail();
    });
  });

  // Обробка натискань на зображення каруселі
  const carouselImages = document.querySelectorAll('.carousel-image');
  carouselImages.forEach(image => {
    image.addEventListener('click', () => {
      modal.style.display = 'flex';
      modalImage.src = image.src;
    });
  });

  prevButton.addEventListener('click', () => {
    currentIndex = (currentIndex > 0) ? currentIndex - 1 : images.length - 1;
    mainImage.src = images[currentIndex];
    updateActiveThumbnail();
  });

  nextButton.addEventListener('click', () => {
    currentIndex = (currentIndex < images.length - 1) ? currentIndex + 1 : 0;
    mainImage.src = images[currentIndex];
    updateActiveThumbnail();
  });

  // Закриття модального вікна
  closeModal.addEventListener('click', () => {
    modal.style.display = 'none';
  });

  // Закриття модального вікна при натисканні поза ним
  window.addEventListener('click', (event) => {
    if (event.target === modal) {
      modal.style.display = 'none';
    }
  });
  updateActiveThumbnail();

}

document.addEventListener('DOMContentLoaded', initializeSlider);
; (async () => {
  const { ProductService } = await import('../services/product.js')
  const { addToCart } = await import('./components/add-to-cart.js')
  const { addToFavorite } = await import('./components/add-to-favorite.js')
  const { addToWatched } = await import('./components/add-to-watched.js')

  const DOM = actualDOM()

  try {
    const productId = new URLSearchParams(window.location.search).get(
      'productId'
    )
    const responseProduct = await ProductService.getOne({ productId })

    if (!responseProduct.success) return

    if (Object.keys(responseProduct.product).length) {
      const product = responseProduct.product

      DOM.product.innerHTML = productTemplate({ product })
      document.title = `${responseProduct.product.name} | FixHealth`

      addToCart()
      addToFavorite()
      addToWatched({ productId: product._id })
      initializeSlider();
    }
  } catch (error) {
    console.log(error)
  }

})()